apuntes/box2d/box2d.tex
% Created 2023-11-04 Sat 23:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.11)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Box 2d apuntes}
\label{sec:org6d6bf87}

\subsection{Conceptos}
\label{sec:orgfb0259f}
\subsubsection{Shape}
\label{sec:org35f2d67}
Figura 2D
Tambien conocido como fixture?
\subsubsection{Rigid body}
\label{sec:org72b1f51}
Tambien conocido como body.
Cuerpos rigidos?
\subsubsection{Fixture}
\label{sec:orge0087d0}
Une un shape con un rigid body y añade propiedades materiales como densidad, friccion y restitucion.
Esta es la que pone a una shape en el sistema de colision; asi logrando que pueda colisionar con otros objetos.
\subsubsection{Constraint}
\label{sec:org23056b8}
Coneccion fisica que remueve grados de libertad de cuerpos.
\textbf{Un cuerpo 2d tiene 3 grados de libertad}. 
\subsubsection{Contact constraint}
\label{sec:org3f4a89d}
Constraint especialmente diseñada para prevenir la penetracion de rigid bodys y para simular \textbf{friccion y restitucion}.
\textbf{Son creadas automaticamente por Box2d}.
\subsubsection{Joint}
\label{sec:orgbeff2c5}
Constraint usada para mantener a dos cuerpos juntos.
Hay muchos tipos:
\begin{itemize}
\item revolute
\item prismatic
\item distance
\item Y mas
\end{itemize}
Alguna de estas tienen limit y motor (ver mas abajo)

\subsubsection{Joint limit}
\label{sec:org5cf9a4a}
Limita el rango de movimiento de un joint. 
\subsubsection{Joint motor}
\label{sec:org440d5bd}
Es el encargado de manejar el moviemiento del joint segun el grado de libertad de la joint. 
\subsubsection{World}
\label{sec:orga65d599}
Colleccion de bodys, shapes y constraints que interactuan juntos. 
Se pueden crear varios mundos, pero no suele ser necesario.
\subsubsection{Solver}
\label{sec:org039840f}
El world tiene un solver que es usado para avanzar el tiempo y calcular contancto y joint constraints.
Es O(n) siendo n la cantidad de constraints.
\subsubsection{Continuous collision}
\label{sec:orgde71ed0}
Nada un socotroco que evita las cosas se teletransporten.
\subsection{Modulos}
\label{sec:org78f2375}
Box2d esta compuesto de 3 modulos
\subsubsection{Common}
\label{sec:org0bf3425}
Codigo para allocacion(?, matematica y configuraicones
\subsubsection{Collision}
\label{sec:orgcc6cf99}
Define shapes, "broad phase"y las funciones de collision
\subsubsection{Dynamics}
\label{sec:org09e00be}
Define el el world, bodies, shapes y joints
\subsection{Units}
\label{sec:orgc31b0c7}
Box2d usa floats.
Tiene que trabajar con tolerancias medidas en metros, kilogramos y segundos (GOATed)
\textbf{Esta optimizado para mover figuras entre 0.1 y 10 metros}.
En teoria, puede representar cosas hasta 50 metros.
\textbf{Usa radianes} para los angulos. NO ANGULOS.

\textbf{NO es recomendado usar pixeles como unidad de medida}.
\textbf{Los worlds deberian ser de 2km o menos}

\subsection{Factories}
\label{sec:orge792f8f}
Si vos queres crear un b2Body o b2Joint tenes que llamar a las funciones factory EN b2World.
\textbf{NO} crear a los objetos de otra forma.

Funciones de creacion:
\begin{verbatim}
b2Body* b2World::CreateBody(const b2BodyDef* def);

b2Joint* b2World::CreateJoint(const b2JointDef* def);
\end{verbatim}

Funciones de destruccion:
\begin{verbatim}
void b2World::DestroyBody(b2Body* body);

void b2World::DestroyJoint(b2Joint* joint);

\end{verbatim}


Cuando creas un body o joint tenes que dar una definicion. Esta definicion tiene que tener \textbf{toda} la infomacion necesaria  para crear un body o joint.

Como las shapes (fixtures) estan atadas a un cuerpo, son creadas y destruidas usando una factory.
\begin{verbatim}
b2Fixture* b2Body::CreateFixture(const b2FixtureDef* def);

void b2Body::DestroyFixture(b2Fixture* fixture);

  //Tambien una funcion mas corta
b2Fixture* b2Body::CreateFixture(const b2Shape* shape, float density);



\end{verbatim}
\end{document}
